from bulls_and_cows import NUMBER_LENGHT

HELLO_MESSAGE_TEXT = "Play with me, {} 👋!"
RULS_MESSAGE_TEXT = "ПРАВИЛА"

WRONG_INPUT_TEXT = "Wrong input!"
PUT_THE_NUMBER_TEXT = f"Put a {NUMBER_LENGHT}-digit number:"
GAME_STEP_TEXT = "{} : 🐂 {}    🐮 {}\n---------------\n"

SEARCHING_OPPONENT_TEXT = "Searching opponent..."

BEGIN_PVP_GAME_TEXT = "Your opponent is {} 👋!  Put the number:"
BEGIN_SINGLE_GAME_TEXT = "Let's go! {PUT_THE_NUMBER_TEXT}"

WIN_TEXT = "You win 👋!    Steps: {}"
LOSE_TEXT = "You lose 😢!"

RULLS_TEXT = """правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила 
правила правила правила правила правила правила правила правила"""